In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv('Strings.csv')

In [22]:
df.head()

   Age  Income_M  Expenses
0   10     12000      8000
1   30     45000     21000
2   34     39000     20000
3   16      6000      2000
4   19     20000     10000

df.info()

In [10]:
df['Income_M']=df.Income_M.str.replace("Rs","")

In [11]:
df['Income_M']=df.Income_M.str.replace("/-","")

In [14]:
df['Income_M']=df.Income_M.astype('int64')

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
Age         20 non-null int64
Income_M    20 non-null int64
Expenses    20 non-null object
dtypes: int64(2), object(1)
memory usage: 464.0+ bytes

In [18]:
df['Expenses']=df.Expenses.str.replace(",","")

In [19]:
df['Expenses']=df.Expenses.astype('int64')

In [21]:
df.describe()

             Age       Income_M      Expenses
count  20.000000      20.000000     20.000000
mean   42.150000   36600.000000  10925.000000
std    23.286036   22579.450369   6955.261167
min     9.000000    2000.000000    500.000000
25%    27.000000   22250.000000   7000.000000
50%    41.500000   34000.000000  10000.000000
75%    50.750000   47750.000000  12000.000000
max    96.000000  100000.000000  30000.000000